/***
TrueStrCode 版本:v1.0
简要说明:这家伙很懒什么都没写
创建人:ZЁЯ¤  身高:168cm+;体重:57kg+;未婚(已有女友);最爱的运动:睡觉;格言:路见不平,拔腿就跑;QQ:358315553
创建时间:2010年9月22日 15:48:04
历次修改:未有修改
用法举例:这家伙很懒什么都没写
*/

package zero.swf.avm1{
	import flash.display.*;
	import flash.events.*;
	import flash.utils.*;
	
	import zero.BytesAndStr16;
	
	public class TrueStrCode{
		public static var trueStrCodeV:Vector.<int>=getTrueStrCodeV();
		private static function getTrueStrCodeV():Vector.<int>{
			var totalTrueStrCode:int=0;
			var trueStrCodeV:Vector.<int>=new Vector.<int>();
			for(var strCode:int=0x01;strCode<0xfc00;strCode++){
				if(
					strCode==0xc000
					||
					strCode==0xc080
					||
					strCode==0xc100
					||
					strCode==0xc140
				){
					continue;
				}else if(strCode>0xc100){
					if(strCode&0xff){
					}else{
						continue;
					}
				}else if(strCode<0x100&&strCode>0xf7){
					continue;
				}
				trueStrCodeV[totalTrueStrCode++]=strCode;
			}
			return trueStrCodeV;
		}
		
		public static function getTrueStrCode():int{
			return trueStrCodeV[int(trueStrCodeV.length*Math.random())]
		}
		
		public static function addCheckTrueStrCodes(actionRecord:ACTIONRECORD):void{
			var encryptTagData:ByteArray=new ByteArray();
			
			addPushStr(encryptTagData,"output");
			addPushStr(encryptTagData,"");
			encryptTagData[encryptTagData.length]=Op.op$setVariable;
			//var output="";
			
			for each(var strCode:int in TrueStrCode.trueStrCodeV){
				encryptTagData[encryptTagData.length]=Op.op$push;
				var strCodes:String;
				if(strCode>0xff){
					encryptTagData[encryptTagData.length]=0x03;
					encryptTagData[encryptTagData.length]=0x00;
					encryptTagData[encryptTagData.length]=0x00;
					encryptTagData[encryptTagData.length]=strCode>>8;
					strCodes=BytesAndStr16._16V[strCode>>>8]+","+BytesAndStr16._16V[strCode&0xff];
				}else{
					encryptTagData[encryptTagData.length]=0x02;
					encryptTagData[encryptTagData.length]=0x00;
					encryptTagData[encryptTagData.length]=0x00;
					strCodes=BytesAndStr16._16V[strCode];
				}
				encryptTagData[encryptTagData.length]=strCode;
				//push 字符串
				
				encryptTagData[encryptTagData.length]=Op.op$dup;
				//dup
				
				encryptTagData[encryptTagData.length]=Op.op$branchIfTrue;
				encryptTagData[encryptTagData.length]=0x02;
				encryptTagData[encryptTagData.length]=0x00;
				encryptTagData[encryptTagData.length]=0x00;
				encryptTagData[encryptTagData.length]=0x00;
				//branchIfTrue label1
				var jumpLabel1Pos:int=encryptTagData.length;
				
				encryptTagData[encryptTagData.length]=Op.op$dup;
				//dup
				
				addPushStr(encryptTagData,"逻辑值为假的字符串: "+strCodes+"\n");
				//push ',strCodes=0xXX'
				
				encryptTagData[encryptTagData.length]=Op.op$add;
				//add
				
				addPushStr(encryptTagData,"output");
				encryptTagData[encryptTagData.length]=Op.op$getVariable;
				encryptTagData[encryptTagData.length]=Op.op$swap;
				encryptTagData[encryptTagData.length]=Op.op$add;
				addPushStr(encryptTagData,"output");
				encryptTagData[encryptTagData.length]=Op.op$swap;
				encryptTagData[encryptTagData.length]=Op.op$setVariable;
				//output=output+xxx
				
				var jumpLabel1Offset:int=encryptTagData.length-jumpLabel1Pos;
				encryptTagData[jumpLabel1Pos-2]=jumpLabel1Offset;
				encryptTagData[jumpLabel1Pos-1]=jumpLabel1Offset>>8;
				
				encryptTagData[encryptTagData.length]=Op.op$pop;
				//pop
			}
			
			addPushStr(encryptTagData,"txt");
			encryptTagData[encryptTagData.length]=Op.op$getVariable;
			addPushStr(encryptTagData,"text");
			addPushStr(encryptTagData,"output");
			encryptTagData[encryptTagData.length]=Op.op$getVariable;
			encryptTagData[encryptTagData.length]=Op.op$setMember;
			
			actionRecord.initByData(encryptTagData,0,encryptTagData.length);
		}
		private static function addPushStr(data:ByteArray,str:String):void{
			var offset:int=data.length;
			data[offset++]=Op.op$push;
			data[offset++]=0x00;
			data[offset++]=0x00;
			data[offset++]=0x00;
			data.position=offset;
			data.writeUTFBytes(str+"\x00");
			var strSize:int=data.length-offset+1;
			data[offset-3]=strSize;
			data[offset-2]=strSize>>8;
		}
	}
	
	//逻辑值为假的字符串: 00
	//逻辑值为假的字符串: f8
	//逻辑值为假的字符串: f9
	//逻辑值为假的字符串: fa
	//逻辑值为假的字符串: fb
	//逻辑值为假的字符串: fc
	//逻辑值为假的字符串: fd
	//逻辑值为假的字符串: fe
	//逻辑值为假的字符串: ff
	//逻辑值为假的字符串: c0,00
	//逻辑值为假的字符串: c0,80
	//逻辑值为假的字符串: c1,00
	//逻辑值为假的字符串: c1,40
	//逻辑值为假的字符串: c2,00
	//逻辑值为假的字符串: c3,00
	//逻辑值为假的字符串: c4,00
	//逻辑值为假的字符串: c5,00
	//逻辑值为假的字符串: c6,00
	//逻辑值为假的字符串: c7,00
	//逻辑值为假的字符串: c8,00
	//逻辑值为假的字符串: c9,00
	//逻辑值为假的字符串: ca,00
	//逻辑值为假的字符串: cb,00
	//逻辑值为假的字符串: cc,00
	//逻辑值为假的字符串: cd,00
	//逻辑值为假的字符串: ce,00
	//逻辑值为假的字符串: cf,00
	//逻辑值为假的字符串: d0,00
	//逻辑值为假的字符串: d1,00
	//逻辑值为假的字符串: d2,00
	//逻辑值为假的字符串: d3,00
	//逻辑值为假的字符串: d4,00
	//逻辑值为假的字符串: d5,00
	//逻辑值为假的字符串: d6,00
	//逻辑值为假的字符串: d7,00
	//逻辑值为假的字符串: d8,00
	//逻辑值为假的字符串: d9,00
	//逻辑值为假的字符串: da,00
	//逻辑值为假的字符串: db,00
	//逻辑值为假的字符串: dc,00
	//逻辑值为假的字符串: dd,00
	//逻辑值为假的字符串: de,00
	//逻辑值为假的字符串: df,00
	//逻辑值为假的字符串: e0,00
	//逻辑值为假的字符串: e1,00
	//逻辑值为假的字符串: e2,00
	//逻辑值为假的字符串: e3,00
	//逻辑值为假的字符串: e4,00
	//逻辑值为假的字符串: e5,00
	//逻辑值为假的字符串: e6,00
	//逻辑值为假的字符串: e7,00
	//逻辑值为假的字符串: e8,00
	//逻辑值为假的字符串: e9,00
	//逻辑值为假的字符串: ea,00
	//逻辑值为假的字符串: eb,00
	//逻辑值为假的字符串: ec,00
	//逻辑值为假的字符串: ed,00
	//逻辑值为假的字符串: ee,00
	//逻辑值为假的字符串: ef,00
	//逻辑值为假的字符串: f0,00
	//逻辑值为假的字符串: f1,00
	//逻辑值为假的字符串: f2,00
	//逻辑值为假的字符串: f3,00
	//逻辑值为假的字符串: f4,00
	//逻辑值为假的字符串: f5,00
	//逻辑值为假的字符串: f6,00
	//逻辑值为假的字符串: f7,00
	//逻辑值为假的字符串: f8,00
	//逻辑值为假的字符串: f9,00
	//逻辑值为假的字符串: fa,00
	//逻辑值为假的字符串: fb,00
	//逻辑值为假的字符串: fc,00
	//逻辑值为假的字符串: fc,01
	//逻辑值为假的字符串: fc,02
	//逻辑值为假的字符串: fc,03
	//逻辑值为假的字符串: fc,04
	//逻辑值为假的字符串: fc,05
	//逻辑值为假的字符串: fc,06
	//逻辑值为假的字符串: fc,07
	//逻辑值为假的字符串: fc,08
	//逻辑值为假的字符串: fc,09
	//逻辑值为假的字符串: fc,0a
	//逻辑值为假的字符串: fc,0b
	//逻辑值为假的字符串: fc,0c
	//逻辑值为假的字符串: fc,0d
	//逻辑值为假的字符串: fc,0e
	//逻辑值为假的字符串: fc,0f
	//逻辑值为假的字符串: fc,10
	//逻辑值为假的字符串: fc,11
	//逻辑值为假的字符串: fc,12
	//逻辑值为假的字符串: fc,13
	//逻辑值为假的字符串: fc,14
	//逻辑值为假的字符串: fc,15
	//逻辑值为假的字符串: fc,16
	//逻辑值为假的字符串: fc,17
	//逻辑值为假的字符串: fc,18
	//逻辑值为假的字符串: fc,19
	//逻辑值为假的字符串: fc,1a
	//逻辑值为假的字符串: fc,1b
	//逻辑值为假的字符串: fc,1c
	//逻辑值为假的字符串: fc,1d
	//逻辑值为假的字符串: fc,1e
	//逻辑值为假的字符串: fc,1f
	//逻辑值为假的字符串: fc,20
	//逻辑值为假的字符串: fc,21
	//逻辑值为假的字符串: fc,22
	//逻辑值为假的字符串: fc,23
	//逻辑值为假的字符串: fc,24
	//逻辑值为假的字符串: fc,25
	//逻辑值为假的字符串: fc,26
	//逻辑值为假的字符串: fc,27
	//逻辑值为假的字符串: fc,28
	//逻辑值为假的字符串: fc,29
	//逻辑值为假的字符串: fc,2a
	//逻辑值为假的字符串: fc,2b
	//逻辑值为假的字符串: fc,2c
	//逻辑值为假的字符串: fc,2d
	//逻辑值为假的字符串: fc,2e
	//逻辑值为假的字符串: fc,2f
	//逻辑值为假的字符串: fc,30
	//逻辑值为假的字符串: fc,31
	//逻辑值为假的字符串: fc,32
	//逻辑值为假的字符串: fc,33
	//逻辑值为假的字符串: fc,34
	//逻辑值为假的字符串: fc,35
	//逻辑值为假的字符串: fc,36
	//逻辑值为假的字符串: fc,37
	//逻辑值为假的字符串: fc,38
	//逻辑值为假的字符串: fc,39
	//逻辑值为假的字符串: fc,3a
	//逻辑值为假的字符串: fc,3b
	//逻辑值为假的字符串: fc,3c
	//逻辑值为假的字符串: fc,3d
	//逻辑值为假的字符串: fc,3e
	//逻辑值为假的字符串: fc,3f
	//逻辑值为假的字符串: fc,40
	//逻辑值为假的字符串: fc,41
	//逻辑值为假的字符串: fc,42
	//逻辑值为假的字符串: fc,43
	//逻辑值为假的字符串: fc,44
	//逻辑值为假的字符串: fc,45
	//逻辑值为假的字符串: fc,46
	//逻辑值为假的字符串: fc,47
	//逻辑值为假的字符串: fc,48
	//逻辑值为假的字符串: fc,49
	//逻辑值为假的字符串: fc,4a
	//逻辑值为假的字符串: fc,4b
	//逻辑值为假的字符串: fc,4c
	//逻辑值为假的字符串: fc,4d
	//逻辑值为假的字符串: fc,4e
	//逻辑值为假的字符串: fc,4f
	//逻辑值为假的字符串: fc,50
	//逻辑值为假的字符串: fc,51
	//逻辑值为假的字符串: fc,52
	//逻辑值为假的字符串: fc,53
	//逻辑值为假的字符串: fc,54
	//逻辑值为假的字符串: fc,55
	//逻辑值为假的字符串: fc,56
	//逻辑值为假的字符串: fc,57
	//逻辑值为假的字符串: fc,58
	//逻辑值为假的字符串: fc,59
	//逻辑值为假的字符串: fc,5a
	//逻辑值为假的字符串: fc,5b
	//逻辑值为假的字符串: fc,5c
	//逻辑值为假的字符串: fc,5d
	//逻辑值为假的字符串: fc,5e
	//逻辑值为假的字符串: fc,5f
	//逻辑值为假的字符串: fc,60
	//逻辑值为假的字符串: fc,61
	//逻辑值为假的字符串: fc,62
	//逻辑值为假的字符串: fc,63
	//逻辑值为假的字符串: fc,64
	//逻辑值为假的字符串: fc,65
	//逻辑值为假的字符串: fc,66
	//逻辑值为假的字符串: fc,67
	//逻辑值为假的字符串: fc,68
	//逻辑值为假的字符串: fc,69
	//逻辑值为假的字符串: fc,6a
	//逻辑值为假的字符串: fc,6b
	//逻辑值为假的字符串: fc,6c
	//逻辑值为假的字符串: fc,6d
	//逻辑值为假的字符串: fc,6e
	//逻辑值为假的字符串: fc,6f
	//逻辑值为假的字符串: fc,70
	//逻辑值为假的字符串: fc,71
	//逻辑值为假的字符串: fc,72
	//逻辑值为假的字符串: fc,73
	//逻辑值为假的字符串: fc,74
	//逻辑值为假的字符串: fc,75
	//逻辑值为假的字符串: fc,76
	//逻辑值为假的字符串: fc,77
	//逻辑值为假的字符串: fc,78
	//逻辑值为假的字符串: fc,79
	//逻辑值为假的字符串: fc,7a
	//逻辑值为假的字符串: fc,7b
	//逻辑值为假的字符串: fc,7c
	//逻辑值为假的字符串: fc,7d
	//逻辑值为假的字符串: fc,7e
	//逻辑值为假的字符串: fc,7f
	//逻辑值为假的字符串: fc,80
	//逻辑值为假的字符串: fc,81
	//逻辑值为假的字符串: fc,82
	//逻辑值为假的字符串: fc,83
	//逻辑值为假的字符串: fc,84
	//逻辑值为假的字符串: fc,85
	//逻辑值为假的字符串: fc,86
	//逻辑值为假的字符串: fc,87
	//逻辑值为假的字符串: fc,88
	//逻辑值为假的字符串: fc,89
	//逻辑值为假的字符串: fc,8a
	//逻辑值为假的字符串: fc,8b
	//逻辑值为假的字符串: fc,8c
	//逻辑值为假的字符串: fc,8d
	//逻辑值为假的字符串: fc,8e
	//逻辑值为假的字符串: fc,8f
	//逻辑值为假的字符串: fc,90
	//逻辑值为假的字符串: fc,91
	//逻辑值为假的字符串: fc,92
	//逻辑值为假的字符串: fc,93
	//逻辑值为假的字符串: fc,94
	//逻辑值为假的字符串: fc,95
	//逻辑值为假的字符串: fc,96
	//逻辑值为假的字符串: fc,97
	//逻辑值为假的字符串: fc,98
	//逻辑值为假的字符串: fc,99
	//逻辑值为假的字符串: fc,9a
	//逻辑值为假的字符串: fc,9b
	//逻辑值为假的字符串: fc,9c
	//逻辑值为假的字符串: fc,9d
	//逻辑值为假的字符串: fc,9e
	//逻辑值为假的字符串: fc,9f
	//逻辑值为假的字符串: fc,a0
	//逻辑值为假的字符串: fc,a1
	//逻辑值为假的字符串: fc,a2
	//逻辑值为假的字符串: fc,a3
	//逻辑值为假的字符串: fc,a4
	//逻辑值为假的字符串: fc,a5
	//逻辑值为假的字符串: fc,a6
	//逻辑值为假的字符串: fc,a7
	//逻辑值为假的字符串: fc,a8
	//逻辑值为假的字符串: fc,a9
	//逻辑值为假的字符串: fc,aa
	//逻辑值为假的字符串: fc,ab
	//逻辑值为假的字符串: fc,ac
	//逻辑值为假的字符串: fc,ad
	//逻辑值为假的字符串: fc,ae
	//逻辑值为假的字符串: fc,af
	//逻辑值为假的字符串: fc,b0
	//逻辑值为假的字符串: fc,b1
	//逻辑值为假的字符串: fc,b2
	//逻辑值为假的字符串: fc,b3
	//逻辑值为假的字符串: fc,b4
	//逻辑值为假的字符串: fc,b5
	//逻辑值为假的字符串: fc,b6
	//逻辑值为假的字符串: fc,b7
	//逻辑值为假的字符串: fc,b8
	//逻辑值为假的字符串: fc,b9
	//逻辑值为假的字符串: fc,ba
	//逻辑值为假的字符串: fc,bb
	//逻辑值为假的字符串: fc,bc
	//逻辑值为假的字符串: fc,bd
	//逻辑值为假的字符串: fc,be
	//逻辑值为假的字符串: fc,bf
	//逻辑值为假的字符串: fc,c0
	//逻辑值为假的字符串: fc,c1
	//逻辑值为假的字符串: fc,c2
	//逻辑值为假的字符串: fc,c3
	//逻辑值为假的字符串: fc,c4
	//逻辑值为假的字符串: fc,c5
	//逻辑值为假的字符串: fc,c6
	//逻辑值为假的字符串: fc,c7
	//逻辑值为假的字符串: fc,c8
	//逻辑值为假的字符串: fc,c9
	//逻辑值为假的字符串: fc,ca
	//逻辑值为假的字符串: fc,cb
	//逻辑值为假的字符串: fc,cc
	//逻辑值为假的字符串: fc,cd
	//逻辑值为假的字符串: fc,ce
	//逻辑值为假的字符串: fc,cf
	//逻辑值为假的字符串: fc,d0
	//逻辑值为假的字符串: fc,d1
	//逻辑值为假的字符串: fc,d2
	//逻辑值为假的字符串: fc,d3
	//逻辑值为假的字符串: fc,d4
	//逻辑值为假的字符串: fc,d5
	//逻辑值为假的字符串: fc,d6
	//逻辑值为假的字符串: fc,d7
	//逻辑值为假的字符串: fc,d8
	//逻辑值为假的字符串: fc,d9
	//逻辑值为假的字符串: fc,da
	//逻辑值为假的字符串: fc,db
	//逻辑值为假的字符串: fc,dc
	//逻辑值为假的字符串: fc,dd
	//逻辑值为假的字符串: fc,de
	//逻辑值为假的字符串: fc,df
	//逻辑值为假的字符串: fc,e0
	//逻辑值为假的字符串: fc,e1
	//逻辑值为假的字符串: fc,e2
	//逻辑值为假的字符串: fc,e3
	//逻辑值为假的字符串: fc,e4
	//逻辑值为假的字符串: fc,e5
	//逻辑值为假的字符串: fc,e6
	//逻辑值为假的字符串: fc,e7
	//逻辑值为假的字符串: fc,e8
	//逻辑值为假的字符串: fc,e9
	//逻辑值为假的字符串: fc,ea
	//逻辑值为假的字符串: fc,eb
	//逻辑值为假的字符串: fc,ec
	//逻辑值为假的字符串: fc,ed
	//逻辑值为假的字符串: fc,ee
	//逻辑值为假的字符串: fc,ef
	//逻辑值为假的字符串: fc,f0
	//逻辑值为假的字符串: fc,f1
	//逻辑值为假的字符串: fc,f2
	//逻辑值为假的字符串: fc,f3
	//逻辑值为假的字符串: fc,f4
	//逻辑值为假的字符串: fc,f5
	//逻辑值为假的字符串: fc,f6
	//逻辑值为假的字符串: fc,f7
	//逻辑值为假的字符串: fc,f8
	//逻辑值为假的字符串: fc,f9
	//逻辑值为假的字符串: fc,fa
	//逻辑值为假的字符串: fc,fb
	//逻辑值为假的字符串: fc,fc
	//逻辑值为假的字符串: fc,fd
	//逻辑值为假的字符串: fc,fe
	//逻辑值为假的字符串: fc,ff
	//逻辑值为假的字符串: fd,00
	//逻辑值为假的字符串: fd,01
	//逻辑值为假的字符串: fd,02
	//逻辑值为假的字符串: fd,03
	//逻辑值为假的字符串: fd,04
	//逻辑值为假的字符串: fd,05
	//逻辑值为假的字符串: fd,06
	//逻辑值为假的字符串: fd,07
	//逻辑值为假的字符串: fd,08
	//逻辑值为假的字符串: fd,09
	//逻辑值为假的字符串: fd,0a
	//逻辑值为假的字符串: fd,0b
	//逻辑值为假的字符串: fd,0c
	//逻辑值为假的字符串: fd,0d
	//逻辑值为假的字符串: fd,0e
	//逻辑值为假的字符串: fd,0f
	//逻辑值为假的字符串: fd,10
	//逻辑值为假的字符串: fd,11
	//逻辑值为假的字符串: fd,12
	//逻辑值为假的字符串: fd,13
	//逻辑值为假的字符串: fd,14
	//逻辑值为假的字符串: fd,15
	//逻辑值为假的字符串: fd,16
	//逻辑值为假的字符串: fd,17
	//逻辑值为假的字符串: fd,18
	//逻辑值为假的字符串: fd,19
	//逻辑值为假的字符串: fd,1a
	//逻辑值为假的字符串: fd,1b
	//逻辑值为假的字符串: fd,1c
	//逻辑值为假的字符串: fd,1d
	//逻辑值为假的字符串: fd,1e
	//逻辑值为假的字符串: fd,1f
	//逻辑值为假的字符串: fd,20
	//逻辑值为假的字符串: fd,21
	//逻辑值为假的字符串: fd,22
	//逻辑值为假的字符串: fd,23
	//逻辑值为假的字符串: fd,24
	//逻辑值为假的字符串: fd,25
	//逻辑值为假的字符串: fd,26
	//逻辑值为假的字符串: fd,27
	//逻辑值为假的字符串: fd,28
	//逻辑值为假的字符串: fd,29
	//逻辑值为假的字符串: fd,2a
	//逻辑值为假的字符串: fd,2b
	//逻辑值为假的字符串: fd,2c
	//逻辑值为假的字符串: fd,2d
	//逻辑值为假的字符串: fd,2e
	//逻辑值为假的字符串: fd,2f
	//逻辑值为假的字符串: fd,30
	//逻辑值为假的字符串: fd,31
	//逻辑值为假的字符串: fd,32
	//逻辑值为假的字符串: fd,33
	//逻辑值为假的字符串: fd,34
	//逻辑值为假的字符串: fd,35
	//逻辑值为假的字符串: fd,36
	//逻辑值为假的字符串: fd,37
	//逻辑值为假的字符串: fd,38
	//逻辑值为假的字符串: fd,39
	//逻辑值为假的字符串: fd,3a
	//逻辑值为假的字符串: fd,3b
	//逻辑值为假的字符串: fd,3c
	//逻辑值为假的字符串: fd,3d
	//逻辑值为假的字符串: fd,3e
	//逻辑值为假的字符串: fd,3f
	//逻辑值为假的字符串: fd,40
	//逻辑值为假的字符串: fd,41
	//逻辑值为假的字符串: fd,42
	//逻辑值为假的字符串: fd,43
	//逻辑值为假的字符串: fd,44
	//逻辑值为假的字符串: fd,45
	//逻辑值为假的字符串: fd,46
	//逻辑值为假的字符串: fd,47
	//逻辑值为假的字符串: fd,48
	//逻辑值为假的字符串: fd,49
	//逻辑值为假的字符串: fd,4a
	//逻辑值为假的字符串: fd,4b
	//逻辑值为假的字符串: fd,4c
	//逻辑值为假的字符串: fd,4d
	//逻辑值为假的字符串: fd,4e
	//逻辑值为假的字符串: fd,4f
	//逻辑值为假的字符串: fd,50
	//逻辑值为假的字符串: fd,51
	//逻辑值为假的字符串: fd,52
	//逻辑值为假的字符串: fd,53
	//逻辑值为假的字符串: fd,54
	//逻辑值为假的字符串: fd,55
	//逻辑值为假的字符串: fd,56
	//逻辑值为假的字符串: fd,57
	//逻辑值为假的字符串: fd,58
	//逻辑值为假的字符串: fd,59
	//逻辑值为假的字符串: fd,5a
	//逻辑值为假的字符串: fd,5b
	//逻辑值为假的字符串: fd,5c
	//逻辑值为假的字符串: fd,5d
	//逻辑值为假的字符串: fd,5e
	//逻辑值为假的字符串: fd,5f
	//逻辑值为假的字符串: fd,60
	//逻辑值为假的字符串: fd,61
	//逻辑值为假的字符串: fd,62
	//逻辑值为假的字符串: fd,63
	//逻辑值为假的字符串: fd,64
	//逻辑值为假的字符串: fd,65
	//逻辑值为假的字符串: fd,66
	//逻辑值为假的字符串: fd,67
	//逻辑值为假的字符串: fd,68
	//逻辑值为假的字符串: fd,69
	//逻辑值为假的字符串: fd,6a
	//逻辑值为假的字符串: fd,6b
	//逻辑值为假的字符串: fd,6c
	//逻辑值为假的字符串: fd,6d
	//逻辑值为假的字符串: fd,6e
	//逻辑值为假的字符串: fd,6f
	//逻辑值为假的字符串: fd,70
	//逻辑值为假的字符串: fd,71
	//逻辑值为假的字符串: fd,72
	//逻辑值为假的字符串: fd,73
	//逻辑值为假的字符串: fd,74
	//逻辑值为假的字符串: fd,75
	//逻辑值为假的字符串: fd,76
	//逻辑值为假的字符串: fd,77
	//逻辑值为假的字符串: fd,78
	//逻辑值为假的字符串: fd,79
	//逻辑值为假的字符串: fd,7a
	//逻辑值为假的字符串: fd,7b
	//逻辑值为假的字符串: fd,7c
	//逻辑值为假的字符串: fd,7d
	//逻辑值为假的字符串: fd,7e
	//逻辑值为假的字符串: fd,7f
	//逻辑值为假的字符串: fd,80
	//逻辑值为假的字符串: fd,81
	//逻辑值为假的字符串: fd,82
	//逻辑值为假的字符串: fd,83
	//逻辑值为假的字符串: fd,84
	//逻辑值为假的字符串: fd,85
	//逻辑值为假的字符串: fd,86
	//逻辑值为假的字符串: fd,87
	//逻辑值为假的字符串: fd,88
	//逻辑值为假的字符串: fd,89
	//逻辑值为假的字符串: fd,8a
	//逻辑值为假的字符串: fd,8b
	//逻辑值为假的字符串: fd,8c
	//逻辑值为假的字符串: fd,8d
	//逻辑值为假的字符串: fd,8e
	//逻辑值为假的字符串: fd,8f
	//逻辑值为假的字符串: fd,90
	//逻辑值为假的字符串: fd,91
	//逻辑值为假的字符串: fd,92
	//逻辑值为假的字符串: fd,93
	//逻辑值为假的字符串: fd,94
	//逻辑值为假的字符串: fd,95
	//逻辑值为假的字符串: fd,96
	//逻辑值为假的字符串: fd,97
	//逻辑值为假的字符串: fd,98
	//逻辑值为假的字符串: fd,99
	//逻辑值为假的字符串: fd,9a
	//逻辑值为假的字符串: fd,9b
	//逻辑值为假的字符串: fd,9c
	//逻辑值为假的字符串: fd,9d
	//逻辑值为假的字符串: fd,9e
	//逻辑值为假的字符串: fd,9f
	//逻辑值为假的字符串: fd,a0
	//逻辑值为假的字符串: fd,a1
	//逻辑值为假的字符串: fd,a2
	//逻辑值为假的字符串: fd,a3
	//逻辑值为假的字符串: fd,a4
	//逻辑值为假的字符串: fd,a5
	//逻辑值为假的字符串: fd,a6
	//逻辑值为假的字符串: fd,a7
	//逻辑值为假的字符串: fd,a8
	//逻辑值为假的字符串: fd,a9
	//逻辑值为假的字符串: fd,aa
	//逻辑值为假的字符串: fd,ab
	//逻辑值为假的字符串: fd,ac
	//逻辑值为假的字符串: fd,ad
	//逻辑值为假的字符串: fd,ae
	//逻辑值为假的字符串: fd,af
	//逻辑值为假的字符串: fd,b0
	//逻辑值为假的字符串: fd,b1
	//逻辑值为假的字符串: fd,b2
	//逻辑值为假的字符串: fd,b3
	//逻辑值为假的字符串: fd,b4
	//逻辑值为假的字符串: fd,b5
	//逻辑值为假的字符串: fd,b6
	//逻辑值为假的字符串: fd,b7
	//逻辑值为假的字符串: fd,b8
	//逻辑值为假的字符串: fd,b9
	//逻辑值为假的字符串: fd,ba
	//逻辑值为假的字符串: fd,bb
	//逻辑值为假的字符串: fd,bc
	//逻辑值为假的字符串: fd,bd
	//逻辑值为假的字符串: fd,be
	//逻辑值为假的字符串: fd,bf
	//逻辑值为假的字符串: fd,c0
	//逻辑值为假的字符串: fd,c1
	//逻辑值为假的字符串: fd,c2
	//逻辑值为假的字符串: fd,c3
	//逻辑值为假的字符串: fd,c4
	//逻辑值为假的字符串: fd,c5
	//逻辑值为假的字符串: fd,c6
	//逻辑值为假的字符串: fd,c7
	//逻辑值为假的字符串: fd,c8
	//逻辑值为假的字符串: fd,c9
	//逻辑值为假的字符串: fd,ca
	//逻辑值为假的字符串: fd,cb
	//逻辑值为假的字符串: fd,cc
	//逻辑值为假的字符串: fd,cd
	//逻辑值为假的字符串: fd,ce
	//逻辑值为假的字符串: fd,cf
	//逻辑值为假的字符串: fd,d0
	//逻辑值为假的字符串: fd,d1
	//逻辑值为假的字符串: fd,d2
	//逻辑值为假的字符串: fd,d3
	//逻辑值为假的字符串: fd,d4
	//逻辑值为假的字符串: fd,d5
	//逻辑值为假的字符串: fd,d6
	//逻辑值为假的字符串: fd,d7
	//逻辑值为假的字符串: fd,d8
	//逻辑值为假的字符串: fd,d9
	//逻辑值为假的字符串: fd,da
	//逻辑值为假的字符串: fd,db
	//逻辑值为假的字符串: fd,dc
	//逻辑值为假的字符串: fd,dd
	//逻辑值为假的字符串: fd,de
	//逻辑值为假的字符串: fd,df
	//逻辑值为假的字符串: fd,e0
	//逻辑值为假的字符串: fd,e1
	//逻辑值为假的字符串: fd,e2
	//逻辑值为假的字符串: fd,e3
	//逻辑值为假的字符串: fd,e4
	//逻辑值为假的字符串: fd,e5
	//逻辑值为假的字符串: fd,e6
	//逻辑值为假的字符串: fd,e7
	//逻辑值为假的字符串: fd,e8
	//逻辑值为假的字符串: fd,e9
	//逻辑值为假的字符串: fd,ea
	//逻辑值为假的字符串: fd,eb
	//逻辑值为假的字符串: fd,ec
	//逻辑值为假的字符串: fd,ed
	//逻辑值为假的字符串: fd,ee
	//逻辑值为假的字符串: fd,ef
	//逻辑值为假的字符串: fd,f0
	//逻辑值为假的字符串: fd,f1
	//逻辑值为假的字符串: fd,f2
	//逻辑值为假的字符串: fd,f3
	//逻辑值为假的字符串: fd,f4
	//逻辑值为假的字符串: fd,f5
	//逻辑值为假的字符串: fd,f6
	//逻辑值为假的字符串: fd,f7
	//逻辑值为假的字符串: fd,f8
	//逻辑值为假的字符串: fd,f9
	//逻辑值为假的字符串: fd,fa
	//逻辑值为假的字符串: fd,fb
	//逻辑值为假的字符串: fd,fc
	//逻辑值为假的字符串: fd,fd
	//逻辑值为假的字符串: fd,fe
	//逻辑值为假的字符串: fd,ff
	//逻辑值为假的字符串: fe,00
	//逻辑值为假的字符串: fe,01
	//逻辑值为假的字符串: fe,02
	//逻辑值为假的字符串: fe,03
	//逻辑值为假的字符串: fe,04
	//逻辑值为假的字符串: fe,05
	//逻辑值为假的字符串: fe,06
	//逻辑值为假的字符串: fe,07
	//逻辑值为假的字符串: fe,08
	//逻辑值为假的字符串: fe,09
	//逻辑值为假的字符串: fe,0a
	//逻辑值为假的字符串: fe,0b
	//逻辑值为假的字符串: fe,0c
	//逻辑值为假的字符串: fe,0d
	//逻辑值为假的字符串: fe,0e
	//逻辑值为假的字符串: fe,0f
	//逻辑值为假的字符串: fe,10
	//逻辑值为假的字符串: fe,11
	//逻辑值为假的字符串: fe,12
	//逻辑值为假的字符串: fe,13
	//逻辑值为假的字符串: fe,14
	//逻辑值为假的字符串: fe,15
	//逻辑值为假的字符串: fe,16
	//逻辑值为假的字符串: fe,17
	//逻辑值为假的字符串: fe,18
	//逻辑值为假的字符串: fe,19
	//逻辑值为假的字符串: fe,1a
	//逻辑值为假的字符串: fe,1b
	//逻辑值为假的字符串: fe,1c
	//逻辑值为假的字符串: fe,1d
	//逻辑值为假的字符串: fe,1e
	//逻辑值为假的字符串: fe,1f
	//逻辑值为假的字符串: fe,20
	//逻辑值为假的字符串: fe,21
	//逻辑值为假的字符串: fe,22
	//逻辑值为假的字符串: fe,23
	//逻辑值为假的字符串: fe,24
	//逻辑值为假的字符串: fe,25
	//逻辑值为假的字符串: fe,26
	//逻辑值为假的字符串: fe,27
	//逻辑值为假的字符串: fe,28
	//逻辑值为假的字符串: fe,29
	//逻辑值为假的字符串: fe,2a
	//逻辑值为假的字符串: fe,2b
	//逻辑值为假的字符串: fe,2c
	//逻辑值为假的字符串: fe,2d
	//逻辑值为假的字符串: fe,2e
	//逻辑值为假的字符串: fe,2f
	//逻辑值为假的字符串: fe,30
	//逻辑值为假的字符串: fe,31
	//逻辑值为假的字符串: fe,32
	//逻辑值为假的字符串: fe,33
	//逻辑值为假的字符串: fe,34
	//逻辑值为假的字符串: fe,35
	//逻辑值为假的字符串: fe,36
	//逻辑值为假的字符串: fe,37
	//逻辑值为假的字符串: fe,38
	//逻辑值为假的字符串: fe,39
	//逻辑值为假的字符串: fe,3a
	//逻辑值为假的字符串: fe,3b
	//逻辑值为假的字符串: fe,3c
	//逻辑值为假的字符串: fe,3d
	//逻辑值为假的字符串: fe,3e
	//逻辑值为假的字符串: fe,3f
	//逻辑值为假的字符串: fe,40
	//逻辑值为假的字符串: fe,41
	//逻辑值为假的字符串: fe,42
	//逻辑值为假的字符串: fe,43
	//逻辑值为假的字符串: fe,44
	//逻辑值为假的字符串: fe,45
	//逻辑值为假的字符串: fe,46
	//逻辑值为假的字符串: fe,47
	//逻辑值为假的字符串: fe,48
	//逻辑值为假的字符串: fe,49
	//逻辑值为假的字符串: fe,4a
	//逻辑值为假的字符串: fe,4b
	//逻辑值为假的字符串: fe,4c
	//逻辑值为假的字符串: fe,4d
	//逻辑值为假的字符串: fe,4e
	//逻辑值为假的字符串: fe,4f
	//逻辑值为假的字符串: fe,50
	//逻辑值为假的字符串: fe,51
	//逻辑值为假的字符串: fe,52
	//逻辑值为假的字符串: fe,53
	//逻辑值为假的字符串: fe,54
	//逻辑值为假的字符串: fe,55
	//逻辑值为假的字符串: fe,56
	//逻辑值为假的字符串: fe,57
	//逻辑值为假的字符串: fe,58
	//逻辑值为假的字符串: fe,59
	//逻辑值为假的字符串: fe,5a
	//逻辑值为假的字符串: fe,5b
	//逻辑值为假的字符串: fe,5c
	//逻辑值为假的字符串: fe,5d
	//逻辑值为假的字符串: fe,5e
	//逻辑值为假的字符串: fe,5f
	//逻辑值为假的字符串: fe,60
	//逻辑值为假的字符串: fe,61
	//逻辑值为假的字符串: fe,62
	//逻辑值为假的字符串: fe,63
	//逻辑值为假的字符串: fe,64
	//逻辑值为假的字符串: fe,65
	//逻辑值为假的字符串: fe,66
	//逻辑值为假的字符串: fe,67
	//逻辑值为假的字符串: fe,68
	//逻辑值为假的字符串: fe,69
	//逻辑值为假的字符串: fe,6a
	//逻辑值为假的字符串: fe,6b
	//逻辑值为假的字符串: fe,6c
	//逻辑值为假的字符串: fe,6d
	//逻辑值为假的字符串: fe,6e
	//逻辑值为假的字符串: fe,6f
	//逻辑值为假的字符串: fe,70
	//逻辑值为假的字符串: fe,71
	//逻辑值为假的字符串: fe,72
	//逻辑值为假的字符串: fe,73
	//逻辑值为假的字符串: fe,74
	//逻辑值为假的字符串: fe,75
	//逻辑值为假的字符串: fe,76
	//逻辑值为假的字符串: fe,77
	//逻辑值为假的字符串: fe,78
	//逻辑值为假的字符串: fe,79
	//逻辑值为假的字符串: fe,7a
	//逻辑值为假的字符串: fe,7b
	//逻辑值为假的字符串: fe,7c
	//逻辑值为假的字符串: fe,7d
	//逻辑值为假的字符串: fe,7e
	//逻辑值为假的字符串: fe,7f
	//逻辑值为假的字符串: fe,80
	//逻辑值为假的字符串: fe,81
	//逻辑值为假的字符串: fe,82
	//逻辑值为假的字符串: fe,83
	//逻辑值为假的字符串: fe,84
	//逻辑值为假的字符串: fe,85
	//逻辑值为假的字符串: fe,86
	//逻辑值为假的字符串: fe,87
	//逻辑值为假的字符串: fe,88
	//逻辑值为假的字符串: fe,89
	//逻辑值为假的字符串: fe,8a
	//逻辑值为假的字符串: fe,8b
	//逻辑值为假的字符串: fe,8c
	//逻辑值为假的字符串: fe,8d
	//逻辑值为假的字符串: fe,8e
	//逻辑值为假的字符串: fe,8f
	//逻辑值为假的字符串: fe,90
	//逻辑值为假的字符串: fe,91
	//逻辑值为假的字符串: fe,92
	//逻辑值为假的字符串: fe,93
	//逻辑值为假的字符串: fe,94
	//逻辑值为假的字符串: fe,95
	//逻辑值为假的字符串: fe,96
	//逻辑值为假的字符串: fe,97
	//逻辑值为假的字符串: fe,98
	//逻辑值为假的字符串: fe,99
	//逻辑值为假的字符串: fe,9a
	//逻辑值为假的字符串: fe,9b
	//逻辑值为假的字符串: fe,9c
	//逻辑值为假的字符串: fe,9d
	//逻辑值为假的字符串: fe,9e
	//逻辑值为假的字符串: fe,9f
	//逻辑值为假的字符串: fe,a0
	//逻辑值为假的字符串: fe,a1
	//逻辑值为假的字符串: fe,a2
	//逻辑值为假的字符串: fe,a3
	//逻辑值为假的字符串: fe,a4
	//逻辑值为假的字符串: fe,a5
	//逻辑值为假的字符串: fe,a6
	//逻辑值为假的字符串: fe,a7
	//逻辑值为假的字符串: fe,a8
	//逻辑值为假的字符串: fe,a9
	//逻辑值为假的字符串: fe,aa
	//逻辑值为假的字符串: fe,ab
	//逻辑值为假的字符串: fe,ac
	//逻辑值为假的字符串: fe,ad
	//逻辑值为假的字符串: fe,ae
	//逻辑值为假的字符串: fe,af
	//逻辑值为假的字符串: fe,b0
	//逻辑值为假的字符串: fe,b1
	//逻辑值为假的字符串: fe,b2
	//逻辑值为假的字符串: fe,b3
	//逻辑值为假的字符串: fe,b4
	//逻辑值为假的字符串: fe,b5
	//逻辑值为假的字符串: fe,b6
	//逻辑值为假的字符串: fe,b7
	//逻辑值为假的字符串: fe,b8
	//逻辑值为假的字符串: fe,b9
	//逻辑值为假的字符串: fe,ba
	//逻辑值为假的字符串: fe,bb
	//逻辑值为假的字符串: fe,bc
	//逻辑值为假的字符串: fe,bd
	//逻辑值为假的字符串: fe,be
	//逻辑值为假的字符串: fe,bf
	//逻辑值为假的字符串: fe,c0
	//逻辑值为假的字符串: fe,c1
	//逻辑值为假的字符串: fe,c2
	//逻辑值为假的字符串: fe,c3
	//逻辑值为假的字符串: fe,c4
	//逻辑值为假的字符串: fe,c5
	//逻辑值为假的字符串: fe,c6
	//逻辑值为假的字符串: fe,c7
	//逻辑值为假的字符串: fe,c8
	//逻辑值为假的字符串: fe,c9
	//逻辑值为假的字符串: fe,ca
	//逻辑值为假的字符串: fe,cb
	//逻辑值为假的字符串: fe,cc
	//逻辑值为假的字符串: fe,cd
	//逻辑值为假的字符串: fe,ce
	//逻辑值为假的字符串: fe,cf
	//逻辑值为假的字符串: fe,d0
	//逻辑值为假的字符串: fe,d1
	//逻辑值为假的字符串: fe,d2
	//逻辑值为假的字符串: fe,d3
	//逻辑值为假的字符串: fe,d4
	//逻辑值为假的字符串: fe,d5
	//逻辑值为假的字符串: fe,d6
	//逻辑值为假的字符串: fe,d7
	//逻辑值为假的字符串: fe,d8
	//逻辑值为假的字符串: fe,d9
	//逻辑值为假的字符串: fe,da
	//逻辑值为假的字符串: fe,db
	//逻辑值为假的字符串: fe,dc
	//逻辑值为假的字符串: fe,dd
	//逻辑值为假的字符串: fe,de
	//逻辑值为假的字符串: fe,df
	//逻辑值为假的字符串: fe,e0
	//逻辑值为假的字符串: fe,e1
	//逻辑值为假的字符串: fe,e2
	//逻辑值为假的字符串: fe,e3
	//逻辑值为假的字符串: fe,e4
	//逻辑值为假的字符串: fe,e5
	//逻辑值为假的字符串: fe,e6
	//逻辑值为假的字符串: fe,e7
	//逻辑值为假的字符串: fe,e8
	//逻辑值为假的字符串: fe,e9
	//逻辑值为假的字符串: fe,ea
	//逻辑值为假的字符串: fe,eb
	//逻辑值为假的字符串: fe,ec
	//逻辑值为假的字符串: fe,ed
	//逻辑值为假的字符串: fe,ee
	//逻辑值为假的字符串: fe,ef
	//逻辑值为假的字符串: fe,f0
	//逻辑值为假的字符串: fe,f1
	//逻辑值为假的字符串: fe,f2
	//逻辑值为假的字符串: fe,f3
	//逻辑值为假的字符串: fe,f4
	//逻辑值为假的字符串: fe,f5
	//逻辑值为假的字符串: fe,f6
	//逻辑值为假的字符串: fe,f7
	//逻辑值为假的字符串: fe,f8
	//逻辑值为假的字符串: fe,f9
	//逻辑值为假的字符串: fe,fa
	//逻辑值为假的字符串: fe,fb
	//逻辑值为假的字符串: fe,fc
	//逻辑值为假的字符串: fe,fd
	//逻辑值为假的字符串: fe,fe
	//逻辑值为假的字符串: fe,ff
	//逻辑值为假的字符串: ff,00
	//逻辑值为假的字符串: ff,01
	//逻辑值为假的字符串: ff,02
	//逻辑值为假的字符串: ff,03
	//逻辑值为假的字符串: ff,04
	//逻辑值为假的字符串: ff,05
	//逻辑值为假的字符串: ff,06
	//逻辑值为假的字符串: ff,07
	//逻辑值为假的字符串: ff,08
	//逻辑值为假的字符串: ff,09
	//逻辑值为假的字符串: ff,0a
	//逻辑值为假的字符串: ff,0b
	//逻辑值为假的字符串: ff,0c
	//逻辑值为假的字符串: ff,0d
	//逻辑值为假的字符串: ff,0e
	//逻辑值为假的字符串: ff,0f
	//逻辑值为假的字符串: ff,10
	//逻辑值为假的字符串: ff,11
	//逻辑值为假的字符串: ff,12
	//逻辑值为假的字符串: ff,13
	//逻辑值为假的字符串: ff,14
	//逻辑值为假的字符串: ff,15
	//逻辑值为假的字符串: ff,16
	//逻辑值为假的字符串: ff,17
	//逻辑值为假的字符串: ff,18
	//逻辑值为假的字符串: ff,19
	//逻辑值为假的字符串: ff,1a
	//逻辑值为假的字符串: ff,1b
	//逻辑值为假的字符串: ff,1c
	//逻辑值为假的字符串: ff,1d
	//逻辑值为假的字符串: ff,1e
	//逻辑值为假的字符串: ff,1f
	//逻辑值为假的字符串: ff,20
	//逻辑值为假的字符串: ff,21
	//逻辑值为假的字符串: ff,22
	//逻辑值为假的字符串: ff,23
	//逻辑值为假的字符串: ff,24
	//逻辑值为假的字符串: ff,25
	//逻辑值为假的字符串: ff,26
	//逻辑值为假的字符串: ff,27
	//逻辑值为假的字符串: ff,28
	//逻辑值为假的字符串: ff,29
	//逻辑值为假的字符串: ff,2a
	//逻辑值为假的字符串: ff,2b
	//逻辑值为假的字符串: ff,2c
	//逻辑值为假的字符串: ff,2d
	//逻辑值为假的字符串: ff,2e
	//逻辑值为假的字符串: ff,2f
	//逻辑值为假的字符串: ff,30
	//逻辑值为假的字符串: ff,31
	//逻辑值为假的字符串: ff,32
	//逻辑值为假的字符串: ff,33
	//逻辑值为假的字符串: ff,34
	//逻辑值为假的字符串: ff,35
	//逻辑值为假的字符串: ff,36
	//逻辑值为假的字符串: ff,37
	//逻辑值为假的字符串: ff,38
	//逻辑值为假的字符串: ff,39
	//逻辑值为假的字符串: ff,3a
	//逻辑值为假的字符串: ff,3b
	//逻辑值为假的字符串: ff,3c
	//逻辑值为假的字符串: ff,3d
	//逻辑值为假的字符串: ff,3e
	//逻辑值为假的字符串: ff,3f
	//逻辑值为假的字符串: ff,40
	//逻辑值为假的字符串: ff,41
	//逻辑值为假的字符串: ff,42
	//逻辑值为假的字符串: ff,43
	//逻辑值为假的字符串: ff,44
	//逻辑值为假的字符串: ff,45
	//逻辑值为假的字符串: ff,46
	//逻辑值为假的字符串: ff,47
	//逻辑值为假的字符串: ff,48
	//逻辑值为假的字符串: ff,49
	//逻辑值为假的字符串: ff,4a
	//逻辑值为假的字符串: ff,4b
	//逻辑值为假的字符串: ff,4c
	//逻辑值为假的字符串: ff,4d
	//逻辑值为假的字符串: ff,4e
	//逻辑值为假的字符串: ff,4f
	//逻辑值为假的字符串: ff,50
	//逻辑值为假的字符串: ff,51
	//逻辑值为假的字符串: ff,52
	//逻辑值为假的字符串: ff,53
	//逻辑值为假的字符串: ff,54
	//逻辑值为假的字符串: ff,55
	//逻辑值为假的字符串: ff,56
	//逻辑值为假的字符串: ff,57
	//逻辑值为假的字符串: ff,58
	//逻辑值为假的字符串: ff,59
	//逻辑值为假的字符串: ff,5a
	//逻辑值为假的字符串: ff,5b
	//逻辑值为假的字符串: ff,5c
	//逻辑值为假的字符串: ff,5d
	//逻辑值为假的字符串: ff,5e
	//逻辑值为假的字符串: ff,5f
	//逻辑值为假的字符串: ff,60
	//逻辑值为假的字符串: ff,61
	//逻辑值为假的字符串: ff,62
	//逻辑值为假的字符串: ff,63
	//逻辑值为假的字符串: ff,64
	//逻辑值为假的字符串: ff,65
	//逻辑值为假的字符串: ff,66
	//逻辑值为假的字符串: ff,67
	//逻辑值为假的字符串: ff,68
	//逻辑值为假的字符串: ff,69
	//逻辑值为假的字符串: ff,6a
	//逻辑值为假的字符串: ff,6b
	//逻辑值为假的字符串: ff,6c
	//逻辑值为假的字符串: ff,6d
	//逻辑值为假的字符串: ff,6e
	//逻辑值为假的字符串: ff,6f
	//逻辑值为假的字符串: ff,70
	//逻辑值为假的字符串: ff,71
	//逻辑值为假的字符串: ff,72
	//逻辑值为假的字符串: ff,73
	//逻辑值为假的字符串: ff,74
	//逻辑值为假的字符串: ff,75
	//逻辑值为假的字符串: ff,76
	//逻辑值为假的字符串: ff,77
	//逻辑值为假的字符串: ff,78
	//逻辑值为假的字符串: ff,79
	//逻辑值为假的字符串: ff,7a
	//逻辑值为假的字符串: ff,7b
	//逻辑值为假的字符串: ff,7c
	//逻辑值为假的字符串: ff,7d
	//逻辑值为假的字符串: ff,7e
	//逻辑值为假的字符串: ff,7f
	//逻辑值为假的字符串: ff,80
	//逻辑值为假的字符串: ff,81
	//逻辑值为假的字符串: ff,82
	//逻辑值为假的字符串: ff,83
	//逻辑值为假的字符串: ff,84
	//逻辑值为假的字符串: ff,85
	//逻辑值为假的字符串: ff,86
	//逻辑值为假的字符串: ff,87
	//逻辑值为假的字符串: ff,88
	//逻辑值为假的字符串: ff,89
	//逻辑值为假的字符串: ff,8a
	//逻辑值为假的字符串: ff,8b
	//逻辑值为假的字符串: ff,8c
	//逻辑值为假的字符串: ff,8d
	//逻辑值为假的字符串: ff,8e
	//逻辑值为假的字符串: ff,8f
	//逻辑值为假的字符串: ff,90
	//逻辑值为假的字符串: ff,91
	//逻辑值为假的字符串: ff,92
	//逻辑值为假的字符串: ff,93
	//逻辑值为假的字符串: ff,94
	//逻辑值为假的字符串: ff,95
	//逻辑值为假的字符串: ff,96
	//逻辑值为假的字符串: ff,97
	//逻辑值为假的字符串: ff,98
	//逻辑值为假的字符串: ff,99
	//逻辑值为假的字符串: ff,9a
	//逻辑值为假的字符串: ff,9b
	//逻辑值为假的字符串: ff,9c
	//逻辑值为假的字符串: ff,9d
	//逻辑值为假的字符串: ff,9e
	//逻辑值为假的字符串: ff,9f
	//逻辑值为假的字符串: ff,a0
	//逻辑值为假的字符串: ff,a1
	//逻辑值为假的字符串: ff,a2
	//逻辑值为假的字符串: ff,a3
	//逻辑值为假的字符串: ff,a4
	//逻辑值为假的字符串: ff,a5
	//逻辑值为假的字符串: ff,a6
	//逻辑值为假的字符串: ff,a7
	//逻辑值为假的字符串: ff,a8
	//逻辑值为假的字符串: ff,a9
	//逻辑值为假的字符串: ff,aa
	//逻辑值为假的字符串: ff,ab
	//逻辑值为假的字符串: ff,ac
	//逻辑值为假的字符串: ff,ad
	//逻辑值为假的字符串: ff,ae
	//逻辑值为假的字符串: ff,af
	//逻辑值为假的字符串: ff,b0
	//逻辑值为假的字符串: ff,b1
	//逻辑值为假的字符串: ff,b2
	//逻辑值为假的字符串: ff,b3
	//逻辑值为假的字符串: ff,b4
	//逻辑值为假的字符串: ff,b5
	//逻辑值为假的字符串: ff,b6
	//逻辑值为假的字符串: ff,b7
	//逻辑值为假的字符串: ff,b8
	//逻辑值为假的字符串: ff,b9
	//逻辑值为假的字符串: ff,ba
	//逻辑值为假的字符串: ff,bb
	//逻辑值为假的字符串: ff,bc
	//逻辑值为假的字符串: ff,bd
	//逻辑值为假的字符串: ff,be
	//逻辑值为假的字符串: ff,bf
	//逻辑值为假的字符串: ff,c0
	//逻辑值为假的字符串: ff,c1
	//逻辑值为假的字符串: ff,c2
	//逻辑值为假的字符串: ff,c3
	//逻辑值为假的字符串: ff,c4
	//逻辑值为假的字符串: ff,c5
	//逻辑值为假的字符串: ff,c6
	//逻辑值为假的字符串: ff,c7
	//逻辑值为假的字符串: ff,c8
	//逻辑值为假的字符串: ff,c9
	//逻辑值为假的字符串: ff,ca
	//逻辑值为假的字符串: ff,cb
	//逻辑值为假的字符串: ff,cc
	//逻辑值为假的字符串: ff,cd
	//逻辑值为假的字符串: ff,ce
	//逻辑值为假的字符串: ff,cf
	//逻辑值为假的字符串: ff,d0
	//逻辑值为假的字符串: ff,d1
	//逻辑值为假的字符串: ff,d2
	//逻辑值为假的字符串: ff,d3
	//逻辑值为假的字符串: ff,d4
	//逻辑值为假的字符串: ff,d5
	//逻辑值为假的字符串: ff,d6
	//逻辑值为假的字符串: ff,d7
	//逻辑值为假的字符串: ff,d8
	//逻辑值为假的字符串: ff,d9
	//逻辑值为假的字符串: ff,da
	//逻辑值为假的字符串: ff,db
	//逻辑值为假的字符串: ff,dc
	//逻辑值为假的字符串: ff,dd
	//逻辑值为假的字符串: ff,de
	//逻辑值为假的字符串: ff,df
	//逻辑值为假的字符串: ff,e0
	//逻辑值为假的字符串: ff,e1
	//逻辑值为假的字符串: ff,e2
	//逻辑值为假的字符串: ff,e3
	//逻辑值为假的字符串: ff,e4
	//逻辑值为假的字符串: ff,e5
	//逻辑值为假的字符串: ff,e6
	//逻辑值为假的字符串: ff,e7
	//逻辑值为假的字符串: ff,e8
	//逻辑值为假的字符串: ff,e9
	//逻辑值为假的字符串: ff,ea
	//逻辑值为假的字符串: ff,eb
	//逻辑值为假的字符串: ff,ec
	//逻辑值为假的字符串: ff,ed
	//逻辑值为假的字符串: ff,ee
	//逻辑值为假的字符串: ff,ef
	//逻辑值为假的字符串: ff,f0
	//逻辑值为假的字符串: ff,f1
	//逻辑值为假的字符串: ff,f2
	//逻辑值为假的字符串: ff,f3
	//逻辑值为假的字符串: ff,f4
	//逻辑值为假的字符串: ff,f5
	//逻辑值为假的字符串: ff,f6
	//逻辑值为假的字符串: ff,f7
	//逻辑值为假的字符串: ff,f8
	//逻辑值为假的字符串: ff,f9
	//逻辑值为假的字符串: ff,fa
	//逻辑值为假的字符串: ff,fb
	//逻辑值为假的字符串: ff,fc
	//逻辑值为假的字符串: ff,fd
	//逻辑值为假的字符串: ff,fe
	//逻辑值为假的字符串: ff,ff
}

//

// 常忘正则表达式
// /^\s*|\s*$/					//前后空白						"\nabc d  e 哈 哈\t \r".replace(/^\s*|\s*$/g,"") === "abc d  e 哈 哈"
// /[\\\/:*?\"<>|]/				//不合法的windows文件名字符集		"\\\/:*?\"<>|\\\/:*哈 哈?\"<>|\\哈 \/:*?\"<>|".replace(/[\\\/:*?\"<>|]/g,"") === "哈 哈哈 "
// /[a-zA-Z_][a-zA-Z0-9_]*/		//合法的变量名(不考虑中文)
// value=value.replace(/[^a-zA-Z0-9_]/g,"").replace(/^[0-9]*/,"");//替换不合法的变量名
// 先把除字母数字下划线的字符去掉,再把开头的数字去掉
// 想不到怎样能用一个正则表达式搞定...

//正则表达式30分钟入门教程		http://www.unibetter.com/deerchao/zhengzhe-biaodashi-jiaocheng-se.htm
//正则表达式用法及实例			http://eskimo.blogbus.com/logs/29095458.html
//常用正则表达式					http://www.williamlong.info/archives/433.html

/*

//常用值

//常用语句块

*/